coanda/170kpa/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField uniform (40 0 0);

boundaryField
{
    down
    {
        type            symmetryPlane;
    }
    right
    {
        type            zeroGradient;
    }
    up
    {
        type            symmetryPlane;
    }
    meanFlow
    {
        type            uniformFixedValue;
        uniformValue    constant (40 0 0);
        value           uniform (40 0 0);
    }
    surface
    {
        type            noSlip;
    }
    coandaInlet
    {
        type            zeroGradient
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
