coanda/170kpa/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type          forces;
    libs          ("libforces.so");

    writeControl  timeStep;
    writeInterval  250;

    log           no;

    patches       ("surface");
    rho           rho;     // Indicates incompressible
    log           true;

    CofR          (0 0 0);    // Rotation around centre line of propeller
}


// ************************************************************************* //
